cf/Catalogs/КартинкиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>КартинкиНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.НоменклатураСайтGarage</xr:Item>
				<xr:Item>Catalog.НоменклатураСайтLicota</xr:Item>
				<xr:Item>Catalog.НоменклатураСайтProm</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Аватар</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПредставлениеОбъекта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьНаСайт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КопияКартинки</Name>
					<Comment>значит что эта картинка точно такаяже и на нее ссылается текущая картинка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КартинкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьВОблакеЛокальный</Name>
					<Comment>относительный путь к файлу в облаке относительно сервера 1с</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьВОблакеHTTP</Name>
					<Comment>Относительный путь к картинке из вне по http</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширениеАватар</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширениеКартинка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИконкаКатегории</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/CommonForms/ВыгрузитьКартинкиНоменклатуры/Ext/Form/Module.bsl
&НаСервере
Функция ОтброситьПоследнююТочку(ИмяФайла)
	
	// Послежнюю точку в названии не берет и все что от нее справа тоже остальное забираем
	
	новСтр	= "";
	стр 	= СтрЗаменить(ИмяФайла,".",Символы.ПС);
	строк 	= СтрЧислоСтрок(стр);
	Если строк = 1 Тогда Возврат ИмяФайла; КонецЕсли;
	Для Ном = 1 По строк - 1 Цикл новСтр = новСтр + ?(новСтр = "","",".") + СтрПолучитьСтроку(стр, Ном); КонецЦикла;
	
	Возврат новСтр;
	
КонецФункции

&НаСервере
Процедура УдалитьФайлыИзВременногоХранилищаНаСервере(Адреса)
	
	Для Каждого Элемент Из Адреса Цикл УдалитьИзВременногоХранилища(Элемент.Адрес) КонецЦикла
	
КонецПроцедуры
&НаСервере
Функция ПолучитьАдресаНаСервереВХранилище(текНоменклатура)
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ	Ссылка, Наименование КАК ИмяФайла, ЭтоПредставлениеОбъекта, Картинка
	|ИЗ			Справочник.КартинкиНоменклатуры
	|ГДЕ 		Владелец = &Номенклатура
	|");
	
	Запрос.УстановитьПараметр("Номенклатура", текНоменклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Адреса = Новый Массив;
	
	Пока Выборка.Следующий() Цикл 
		
		Картинка = Выборка.Картинка.Получить(); 
		Если ТипЗнч(Картинка) = Тип("Картинка") Тогда
			Адрес = ПоместитьВоВременноеХранилище(Картинка); 
			Адреса.Добавить(Новый Структура("Адрес, Гуид, ИмяФайла, Расширение", 
					Адрес, 
					XMLСтрока(Выборка.Ссылка), 
					ОтброситьПоследнююТочку(Выборка.ИмяФайла), 
					НРег(Строка(Картинка.Формат())))); КонецЕсли;КонецЦикла;
	
	Возврат Адреса;
	
КонецФункции
&НаСервере
Функция ПолучитьТовары()
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ Ссылка ИЗ Справочник.Номенклатура ГДЕ Ссылка В ИЕРАРХИИ(&Ссылки) И НЕ ПометкаУдаления");
	Запрос.УстановитьПараметр("Ссылки", Номенклатура.ВыгрузитьЗначения());
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаКлиенте
Процедура ВыгрузитьНаКлиенте(ПолеИмениФайла)
	
	Ном 		= 0;
	Товары 		= ПолучитьТовары();
	Всего		= Товары.Количество();
	текКаталог	= ?(Прав(Каталог,1) = "\",Каталог, Каталог + "\");
	
	Для Каждого Товар Из Товары Цикл Ном = Ном + 1; ОбработкаПрерыванияПользователя();
		
		Адреса = ПолучитьАдресаНаСервереВХранилище(Товар);
		Для Каждого Элемент Из Адреса Цикл
			
			Картинка = ПолучитьИзВременногоХранилища(Элемент.Адрес);
			Картинка.Записать(текКаталог + Элемент[ПолеИмениФайла] + "." + Элемент.Расширение); 
			
			Если Всего > 1 Тогда
				Состояние("Записываю картинку" , Ном / Всего * 100 , Товар);КонецЕсли;КонецЦикла;
		
		УдалитьФайлыИзВременногоХранилищаНаСервере(Адреса);КонецЦикла; // чистим за собой
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаGUID(Команда)
	
	ВыгрузитьНаКлиенте("Гуид");
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаАртикул(Команда)
	
	//ВыгрузитьНаСервере("Артикул");
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаКакИмяФайла(Команда)
	
	ВыгрузитьНаКлиенте("ИмяФайла");
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Номенклатура 	= Параметры.Номенклатура;
	//Каталог 		= Константы.КаталогКартинокДляСайта.Получить();
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДВ = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Если ДВ.Выбрать() Тогда
		Каталог = ДВ.Каталог; КонецЕсли;
	
КонецПроцедуры
